const Map<String, String> ar = {
  'مرحبا': 'مرحبا',
  'L':
      'هيا بنا معاً لتجربة خدمة تطبيق صحة نخلة الأساسية، شَخِصْ نخلتك واعرف الآفة أو المرض التي قد تكون نخلتك عُرضه اكثر للإصابة بها، واستفد من المعلومات المنشورة لرعاية نخلتك بشكل أفضل ',
  'start': 'ابدأ',
  'About': 'عن صحة نخلة',
  'Home': 'الرئيسية',
  'Result': 'النتيجة',
  'Back': 'السابق',
  'Next': 'التالي',
  'p': 'قيِّم عَرَض الآفة أو المرض من فضلك',
  '1': '٠٪',
  '2': '٢٥٪',
  '3': '٥٠٪',
  '4': '٧٥٪',
  '5': '١٠٠٪',
  'S1': 'ما مدى ظهور ثقوب صغيرة، ونشارة خشبية، على الجذع؟',
  'S2': 'ما مدى ظهور افرازات صمغية بنية، كريهة الرائحة، على الجذع؟',
  'S3': 'ما مدى خشونة نسيج ثمار التمر؟',
  'S4': 'ما مدى وجود نسيج عنكبوتي، متعلقه به الأتربة؟',
  'S5': 'ما مدى ظهور حفر ونقر أسفل الثمار و الأزهار؟',
  'S6': 'مامدى سقوط الثمار الحديثة العقد؟',
  'H1': 'سوسة النخيل الحمراء',
  'H2': 'حلم الغبار',
  'H3': 'سوسة طلع النخيل',
  'A':
      'صحة نخلة هو تطبيق يقدم لك خدمة تشخيص بعض آفات و أمراض أشجار النخيل الأكثر شيوعاً بالمملكة العربية السعودية، قائماً على النظام الخبير و طريقة عامل اليقين التي تعتمد على تقييم المستخدم لعدة أعراض لآفات و أمراض أشجار النخيل. ستكون النتيجة حسب تقييمه للأعراض على نخلته، اسم الآفة أو المرض ونسبة حدوثه وبعض المعلومات حوله',
  'd_r': 'اسم المرض او الآفة المحتمل الذي قد يصيب شجرة نخلتك',
  'rate': 'بمعدل',
  'clickhere': 'انقرهنا',
  'more': 'للمزيد حول هذه الآفة،',
  'some': 'بعض أمراض و آفات أشجار النخيل',
  'a':
      'الحشـــرة الكاملـــة : هـــي حشـــرة كبيرة الحجـــم، لونهـــا برتقالـــي يميل إلى االحمـــرار، يتراوح طولها بين 2.5 – 4 ســـم ويوجد عدد من البقع الســـوداء على ظهـــر الحلقـــة الصدريـــة قـــد تختلف في العـــدد والشـــكل، ولها خرطـــوم أقل  طـــوال لـــدى الذكر، ويحمل شـــعيرات فـــي نهايتـــه وبالقرب مـــن قاعدته يخرج قرنا استشـــعار علـــى جانبيه.  وللحشـــرة الكاملة قدرة على الطيران لمســـافات بعيدة نســـبيا -1 7 كلم، وال تنجـــذب إلى المصائـــد الضوئية، ولديها 3 - 4 أجيال في الســـنة.',
  'b':
      'البيضة : مســـتطيلة، لونهـــا أبيض كريمي المع، ســـطحها أملس وطولها 2.5 مـــم وعرضها 1 مم.',
  'c':
      'اليرقة : هي الطور الضار، وهي عديمة األرجل لونها أبيض مصفر بيضاوية الشكل لها رأس أحمر مسود وأجزاء فم قارضة قوية، واليرقة مكتملة النمو يبلغ طولها 5-3.5 سم ولها قدرة محدودة على الحركة حيث تدفع الجسم إلى األمام ثم باقي الجسم في تتابعات. تتغذى اليرقة بشراهة على األنسجة الوعائية ً محدثة أنفاقا في جميع االتجاهات داخل جذع النخلة.',
  'd': 'الشرنقة : تشبه البرميل بطول حوالي 7 سم وعرض 2.5 سم.',
  'e':
      'العذراء : لونها كريمي يتحول في المراحل األخيرة إلى اللون البني. يصل متوسط طول العذراء إلى حدود 3.5 سم وعرضها 1.5سم. يكون طور العذراء ساكن غير ناشط داخل الشرنقة، حيث تتحول فيه تدريجيا إلى طور الحشرة البالغة.',
  'f':
      'دورة الحياة للسوسة : تتطـــور الحشـــرة مـــن بيضة إلـــى يرقة إلى عذراء داخل شـــرنقة ثم إلى حشـــرة بالغة، فهي نشـــطة وتتكاثر علـــى مدار العـــام وليس لها بيات شـــتوي أو صيفي. تضـــع الأنثى خلال حياتهـــا غالبا من 250 إلـــى 300 بيضة في فتحـــات تحفرها على الجـــذع أو في الثقـــوب والأنفاق التي تحفرها حشـــرات أخـــرى، وكذلك الجروح التـــي يحدثهـــا المـــزارع أثنـــاء العمليات الزراعية علـــى النخلة. بعد أيـــام قليلة 2 - 5 أيـــام  يفقس البيـــض فيعطي يرقات صغيرة فـــي البداية حيث تنمـــو تدريجيا وتحفـــر أنفاقـــا وتتغـــذى بشـــراهة على الأنسجة الوعائية الحيـــة داخل جذع النخلـــة. وبعد وصولهـــا إلى المرحلـــة الأخيرة من عمرها 1 - 3 أشـــهر، تنســـج اليرقة شـــرنقة مـــن الألياف بيضاوية الشـــكل لتتعـــذر داخلها لمـــدة 14 - 21 يوما، ثـــم تخرج الحشـــرة الكاملة بعد انقضـــاء فترة التعذر. تقـــدر دورة الحياة لسوســـة النخيل الحمراء بحوالي 3 - 6 أشـــهر حســـب فصل الســـنة.',
  'g':
      'آفة تنتشر في معظم مناطق زراعات النخيل في المملكة. الحشـــرة الكاملة لها بيات الشـــتوي، حيث تكون تحت قواعـــد الجريد والألياف المحيطة بالطلع عند جمـــارة النخلة تحت الليف. لـــون الحشـــرة الكاملة بنـــي، ويميزهـــا وجـــود بقعتين بلون أســـود على الســـطح الخارجـــي للغمديـــن، والبقعة الأمامية أصغر مـــن الخلفية ولها خر طوم. الأطوار الضارة هي اليرقة والحشرة الكاملة.  اليرقة عديمة الأرجل. يبدأ ظهور الحشـــرة قبل تفتـــح الزهر مع بدايـــة فبراير - أبريل وهو ما يتناســـب مع ظهـــور الطلع إلى ما بعـــد عقد الثمار.',
  'h':
      'يسمى الأكاروس يصيـــب الكثير من العوائـــل النباتية، وهو مـــن الآفات التي تســـبب خســـائر اقتصادية لمحصـــول النخيل. وجاءت تســـمية الأكاروس بحلم الغبـــار بســـبب أن الثمار المصابـــة تكون مغطاة بنســـيج عنكبوتي يفـــرزه الحلم تلتصـــق بـــه ذرات التراب، وبذلـــك يظهـــر التمر والســـعف المصـــاب وكأنه عليه طبقـــة مـــن الغبار ولذلـــك يســـمى. ينتشـــر حلـــم الغبار في العديـــد من بلـــدان العالم وهو مـــن أخطر الآفات التي تصيـــب النخيل، خاصة الموجـــودة في المناطـــق الجافة، وتزداد الإصابة مع نقص ميـــاه الري والإهمال فـــي العمليات الزراعية. وتصل نســـبة الإصابة والخســـارة فـــي المحصول خلال الســـنوات الجافة والحارة.',
};
